% MATLAB上机实验6
% 编写程序，绘图探讨不同公式π精度
% 崔荣成 2019.10.28

% 定义迭代计算次数n
n=(1:30);

% 公式1 π=4*∑((-1).^(n-1)./(2*n-1))
f1=(-1).^(n-1)./(2*n-1);    %f1 记录π的推导公式1
f1=4*cumsum(f1);    % 用cumsum函数累加计算公式1各项
 
% 公式2 π=2*∏(((2*n).^2)./(2*n-1)*(2*n+1))
f2=(((2*n).^2)./((2*n-1).*(2*n+1)));   % f2记录π的推导公式2
f2=2*cumprod(f2);   % 用cumprod函数累乘计算公式2各项
 
% 公式3 π=2*∑()
f3=(n-1)./(2*n-1);     % f3先记录每个累加项中的累乘项
f3(1)=1;   % 需要特别说明第一个累乘项为1，否则按照f3计算为0
f3=cumprod(f3);   % 接着用cumprod函数计算每个累乘项的累乘结果
f3=2*cumsum(f3);    % 最后用cumsum函数把每个累乘结果累加
 
% 公式4 π=2*∏(1+1./(2*n-1)*(2*n+1))
f4=(1+1./(4*n.^2-1));   % f4记录π的推导公式4
f4=2*cumprod(f4);   % 用cumprod函数累乘公式4各项
 
plot(n,f1,'b-o');   % 用蓝色直线圆圈绘制公式1图像
hold on;
plot(n,f2,'r-.*');  % 用红色虚线星号绘制公式2图像
hold on;
plot(n,f3,'g-.o');  % 用绿色虚线圆圈绘制公式3图像
hold on;
plot(n,f4,'y-*');  % 用黄色虚线星号绘制公式4图像
hold on;
plot(n,pi*ones(size(n)),'m')    % 用粉红色直线绘制π的真实值
legend('公式1','公式2','公式3','公式4','真实值')
xlabel('计算次数')
ylabel('计算π值')
title('不同公式求解π值的图像')
hold off